Q1. List any five functions of the pandas library with execution.

In [23]:
#Their are many funtions we use of dataframe like
#.describe()
#.head()
#.tail()
#.iloc
#.loc
#df.info

In [2]:
import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [19]:
df.iloc[0:5,1:3]

   Survived  Pclass
0         0       3
1         1       1
2         1       3
3         1       1
4         0       3

In [21]:
df.loc[0:5,["Survived","Pclass"]]

   Survived  Pclass
0         0       3
1         1       1
2         1       3
3         1       1
4         0       3
5         0       3

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [26]:
import pandas as pd
lst1=["Virat","Rohit","Raina","Jadeja","KL Rahul"]
lst2=[1,3,35,29,24]
lst3=[116,154,78,92,122]
srs1=pd.Series(lst1)
srs2=pd.Series(lst2)
srs3=pd.Series(lst3)
df=pd.DataFrame({"A":lst1,"B":lst2,"C":lst3})

In [31]:
df

          A   B    C
0     Virat   1  116
1     Rohit   3  154
2     Raina  35   78
3    Jadeja  29   92
4  KL Rahul  24  122

In [35]:
l=[]
j=1;
for i in range(len(df)):
    l.append(j);
    j=j+2;
index = pd.Index(l)
df = df.set_index(index)
df

          A   B    C
1     Virat   1  116
3     Rohit   3  154
5     Raina  35   78
7    Jadeja  29   92
9  KL Rahul  24  122

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [39]:
df = df.rename(columns={"C":"Values"})

In [46]:
l=df["Values"].to_list()

In [47]:
sum=0
for i in range(0,3):
    sum=l[i]+sum
print(sum)

348

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [49]:
df = df.rename(columns={"A":"Text"})

In [50]:
df

       Text   B  Values
1     Virat   1     116
3     Rohit   3     154
5     Raina  35      78
7    Jadeja  29      92
9  KL Rahul  24     122

In [56]:
lst1=df["Text"].to_list()
lst2=[len(i) for i in lst1]

In [57]:
df["Word_Count"]=lst2

In [58]:
df

       Text   B  Values  Word_Count
1     Virat   1     116           5
3     Rohit   3     154           5
5     Raina  35      78           5
7    Jadeja  29      92           6
9  KL Rahul  24     122           8

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [60]:
df

       Text   B  Values  Word_Count
1     Virat   1     116           5
3     Rohit   3     154           5
5     Raina  35      78           5
7    Jadeja  29      92           6
9  KL Rahul  24     122           8

In [61]:
df.shape

(5, 4)

In [62]:
df.size

20

In [63]:
#Therefore shape give total number of rows and columns and overall dimension in form of matrix
#While size gives total cells in dataframe

Q6. Which function of pandas do we use to read an excel file?

In [65]:
#We use pd.read_excel to read excel file 
#Example
import pandas as pd
pd.read_excel("Market Data.xlsx").head(2)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [79]:
df=pd.DataFrame({"Id":["pqw45","74kpo","o74ty","ry41w"],"Address":["Mumbai","Delhi","Kolkata","Chennai"],"Email":["rohan.tiwari@microsoft.com","manish.sharma@google.com","Harish.gupta@infosys.com","Sudesh.chakraborthy@Reliance.com"]})

In [80]:
df

      Id  Address                             Email
0  pqw45   Mumbai        rohan.tiwari@microsoft.com
1  74kpo    Delhi          manish.sharma@google.com
2  o74ty  Kolkata          Harish.gupta@infosys.com
3  ry41w  Chennai  Sudesh.chakraborthy@Reliance.com

In [81]:
l=df["Email"].to_list()

In [82]:
l1=[]
for i in range(len(l)):
    l1.append(l[i].partition("@")[0])

In [83]:
l1

['rohan.tiwari', 'manish.sharma', 'Harish.gupta', 'Sudesh.chakraborthy']

In [84]:
df["Username"]=l1

In [85]:
df

      Id  Address                             Email             Username
0  pqw45   Mumbai        rohan.tiwari@microsoft.com         rohan.tiwari
1  74kpo    Delhi          manish.sharma@google.com        manish.sharma
2  o74ty  Kolkata          Harish.gupta@infosys.com         Harish.gupta
3  ry41w  Chennai  Sudesh.chakraborthy@Reliance.com  Sudesh.chakraborthy

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [94]:
df=pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [96]:
def func(df):
    return(df[(df["A"]>5) & (df["B"]<10)])

In [97]:
func(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [98]:
df = df.rename(columns={"C":"Values"})

In [99]:
df

   A  B  Values
0  3  5       1
1  8  2       7
2  6  9       4
3  2  3       5
4  9  1       2

In [101]:
df["Values"].mean()

3.8

df["Values"].median()

In [105]:
df["Values"].describe()

count    5.000000
mean     3.800000
std      2.387467
min      1.000000
25%      2.000000
50%      4.000000
75%      5.000000
max      7.000000
Name: Values, dtype: float64

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [108]:
df=pd.DataFrame({"Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]})

In [109]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [147]:
def func(df):
    import datetime
    l1=df["Date"].to_list()
    l2=[]
    for i in l1:
        l2.append(datetime.datetime(int(i[0:4]),int(i[5:7]),int(i[8:10])).strftime('%A'))
    df["Weekday"]=l2
    return df

In [148]:
func(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [157]:
df=pd.DataFrame({"Date":["2023-01-25","2023-01-15","2023-01-16","2023-02-05","2023-03-05","2023-05-25","2023-07-30","2023-01-21","2023-01-14","2023-10-12"]})

In [158]:
df

         Date
0  2023-01-25
1  2023-01-15
2  2023-01-16
3  2023-02-05
4  2023-03-05
5  2023-05-25
6  2023-07-30
7  2023-01-21
8  2023-01-14
9  2023-10-12

In [172]:
def func(df):
    l1=df["Date"].to_list()
    l2=[]
    for i in l1:
        if((int(i[0:4])==2023) and (int(i[5:7])==1)):
            l2.append(i)
    l2
    return  l2

In [175]:
func(df)

['2023-01-25', '2023-01-15', '2023-01-16', '2023-01-21', '2023-01-14']

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [176]:
#import pandas 
#Pandas is the basic and most important library that needs to be imported